//--------------------------------------------------------------------------------------
// Файл: urok2.fx
// Copyright (c) Microsoft Corporation. Все права защищены.
//--------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------
// Вершинный шейдер
//--------------------------------------------------------------------------------------
float4 VS(float4 Pos : POSITION) : SV_POSITION
{
	//// если в вершинный шейдер добавим:
	Pos.x *= 0.5;// то треугольник должен сжаться, потому что коорд-ты X вершин в 2 раза уменьшатся

	// Оставляем координаты точки без изменений
	return Pos;
}


//--------------------------------------------------------------------------------------
// Пиксельный шейдер
//--------------------------------------------------------------------------------------
float4 PS(float4 Pos : SV_POSITION) : SV_Target
{
	//// Немного модифицируем код пиксельного шейдера. Пусть цвет пикселя зависит от его координат!
	//float fLimiter = 500.0f;
	//float dist = Pos.x*Pos.x + Pos.y*Pos.y;
	//dist = (dist % fLimiter) / fLimiter;
	//return float4(dist, 0.0f, dist, 1.0f);



	// Возвращаем желтый цвет, непрозрачный (альфа == 1, альфа-канал не включен).	
	return float4(1.0f, 0.0f, 0.0f, 1.0f);
}
